/*
Проста програма на Java.
Назвіть програму Example.java.
 */
class Example {
    //Програма начинається з визову main().
    public static void main(String[] args) {
        System.out.println("Проста програма на Java.");
    }
}

/*Метод: 'maim` в мові програмування Java є точковою входу у програму.
коли ви запускаєте програму Java, вокористання розпочинається саме з цього методу.
Ось загальне визначення методу 'main` у Java:

pulic static void main(Stringp[] args) {
    // Код. що використовується при запуску програми
     }

Цей метод має такі особливості:
public: Цей метод доступний для виклику будь-якого іншого класу.
static: Метод main() викликається без створення єкземпляру класу, тобто його потрібно визначити як статичний.
void: Метод main() не повертає значення.
main: Це ім'я методу. Це ключове слово, яке визначає його як точку входу.
(String[] args): Це метод приймає масив рядків як аргумент. Аргумент командного рядка
передачі параметрів або конфігураційної інформації у програму.
Отже, будь-який кол, який ви хочете виконати при запуску програми, слід помістити всередину цього методу.
 */